{
    "id": "api_enablevirtualbackground",
    "name": "enableVirtualBackground",
    "description": "Enables/Disables the virtual background. (beta feature)\nAfter enabling the virtual background feature, you can replace the original background image of the local user with a custom background image. After the replacement, all users in the channel can see the custom background image.\n            \n                    This function requires a high-performance device. Agora recommends that you use this function on devices with the following chips:\n                    Snapdragon 700 series 750G and later\n                    Snapdragon 800 series 835 and later\n                    Dimensity 700 series 720 and later\n                    Kirin 800 series 810 and later\n                    Kirin 900 series 980 and later\n                    Devices with an A9 chip and better, as follows:\n                        iPhone 6S and later\n                        iPad Air 3rd generation and later\n                        iPad 5th generation and later\n                        iPad Pro 2nd generation and later\n                        iPad mini 5th generation and later\n                    \n                Agora recommends that you use this function in scenarios that meet the following conditions:\n                    A high-definition camera device is used, and the environment is uniformly lit.\n                    There are few objects in the captured video. Portraits are half-length and unobstructed. Ensure that the background is a solid color that is different from the color of the user's clothing.\n                \n                The virtual background feature does not support video in the texture format or video obtained from custom video capture by the Push method.",
    "parameters": [
        {
            "enabled": "Whether to enable virtual background:\n                        true: Enable virtual background.\n                        false: Disable virtual background.\n                    "
        },
        {
            "backgroundSource": "The custom background image. See VirtualBackgroundSource. To adapt the resolution of the custom background image to that of the video captured by the SDK, the SDK scales and crops the custom background image while ensuring that the content of the custom background image is not distorted."
        }
    ],
    "returns": ""
}
