{
    "id": "api_setaudioeffectparameters",
    "name": "setAudioEffectParameters",
    "description": "Sets parameters for SDK preset audio effects.\nCall this method to set the following parameters for the local user who sends an audio stream:\n  3D voice effect: Sets the cycle period of the 3D voice effect.\n  Pitch correction effect: Sets the basic mode and tonic pitch of the pitch correction effect. Different songs have different modes and tonic pitches. Agora recommends bounding this method with interface elements to enable users to adjust the pitch correction interactively.\n       \n   \n   After setting the audio parameters, all users in the channel can hear the effect.\n   \n       \n  You can call this method either before or after joining a channel.\n  To get better audio effect quality, Agora recommends calling and setting scenario in setAudioProfile as GameStreaming(3) before calling this method.\n  Do not set the profile parameter in setAudioProfile to SpeechStandard (1), or the method does not take effect.\n  This method works best with the human voice. Agora does not recommend using this method for audio containing music.\n  After calling setAudioEffectParameters, Agora recommends not calling the following methods, or the settings in setAudioEffectParameters are overridden :\n setAudioEffectPreset\n setVoiceBeautifierPreset\n setLocalVoiceReverbPreset\n setLocalVoiceChanger\n setLocalVoicePitch\n setLocalVoiceEqualization\n setLocalVoiceReverb\n setVoiceBeautifierParameters\n          setVoiceConversionPreset",
    "parameters": [
        {
            "preset": "The options for SDK preset audio effects:\n                            RoomAcoustics3DVoice, 3D voice effect:\n                                    Call and set the profile parameter in setAudioProfile to MusicStandardStereo (3) or MusicHighQualityStereo(5) before setting this enumerator; otherwise, the enumerator setting does not take effect.\n                                    If the 3D voice effect is enabled, users need to use stereo audio playback devices to hear the anticipated voice effect.\n                                \n                            \n                            PitchCorrection, Pitch correction effect: To achieve better audio effect quality, Agora recommends calling setAudioProfile and setting the profile parameter to MusicHighQuality (4) or MusicHighQualityStereo(5) before setting this enumerator.\n                        \n                    "
        },
        {
            "param1": "\n      \n If you set preset to RoomAcoustics3DVoice , param1 sets the cycle period of the 3D voice effect. The value range is [1,60] and the unit is seconds. The default value is 10, indicating that the voice moves around you every 10 seconds.\n If you set preset to PitchCorrection , param1 sets the basic mode of the pitch correction effect:\n1: (Default) Natural major scale.\n2: Natural minor scale.\n3: Japanese pentatonic scale.\n     \n \n      \n  "
        },
        {
            "param2": "\n      \n If you set preset to RoomAcoustics3DVoice, you need to set param2 to 0.\n If you set preset to PitchCorrection, param2 sets the tonic pitch of the pitch correction effect:\n1: A\n2: A#\n3: B\n4: (Default) C\n5: C#\n6: D\n7: D#\n8: E\n9: F\n10: F#\n11: G\n12: G#\n     \n \n      \n  "
        }
    ],
    "returns": ""
}
