{
    "id": "api_addvideowatermark2",
    "name": "addVideoWatermark",
    "description": "Adds a watermark image to the local video.\nThis method adds a PNG watermark image to the local video in the live streaming. Once the watermark image is added, all the audience in the channel (CDN audience included), and the capturing device can see and capture it. Agora supports adding only one watermark image onto the local video, and the newly watermark image replaces the previous one.\n   The watermark coordinates are dependent on the settings in the setVideoEncoderConfiguration method:\n  If the orientation mode of the encoding video (VideoOutputOrientationMode) is FIXED_LANDSCAPE, or the landscape mode in ADAPTIVE, the watermark uses the landscape orientation.\n  If the orientation mode of the encoding video (VideoOutputOrientationMode) is FIXED_PORTRAIT, or the portrait mode in ADAPTIVE, the watermark uses the portrait orientation.\n  When setting the watermark position, the region must be less than the dimensions set in the setVideoEncoderConfiguration method. Otherwise, the watermark image will be cropped.\n       \n   \n   \n       \n  Ensure that you have called enableVideo before calling this method.\n  If you only want to add a watermark to the CDN live streaming, you can call this method or the setLiveTranscoding method.\n  This method supports adding a watermark image in the PNG file format only. Supported pixel formats of the PNG image are RGBA, RGB, Palette, Gray, and Alpha_gray.\n  If the dimensions of the PNG image differ from your settings in this method, the image will be cropped or zoomed to conform to your settings.\n  If you have enabled the local video preview by calling the startPreview method, you can use the visibleInPreview member to set whether or not the watermark is visible in the preview.\n  If you have enabled the mirror mode for the local video, the watermark on the local video is also mirrored. To avoid mirroring the watermark, Agora recommends that you do not use the mirror and watermark functions for the local video at the same time. You can implement the watermark function in your application layer.",
    "parameters": [
        {
            "watermarkUrl": "The local file path of the watermark image to be added. This method supports adding a watermark image from the local absolute or relative file path."
        },
        {
            "options": "The options of the watermark image to be added. For details, see WatermarkOptions."
        }
    ],
    "returns": ""
}
