{
    "id": "api_enableremotesuperresolution",
    "name": "enableRemoteSuperResolution",
    "description": "Enables/Disables the super-resolution algorithm for a remote user's video stream.\nThis feature effectively boosts the resolution of a remote user's video seen by the local user. If the original resolution of a remote user's video is a × b, the local user's device can render the remote video at a resolution of 2a × 2b\n            after you enable this feature.\n            After you call this method, the SDK triggers the userSuperResolutionEnabled callback to report whether you have successfully enabled super resolution.\n            The super resolution feature requires extra system resources. To balance the visual experience and system usage, the SDK poses the following restrictions: This feature can only be enabled for a single remote user.\n                On Android, the original resolution of the remote video must not exceed 640 × 360 pixels. On iOS, the original resolution of the remote video must not exceed 640 × 480 pixels. If you exceed these limitations, the SDK triggers the warning callback and returns the corresponding warning codes:\n                SuperResolutionStreamOverLimitation: 1610. The origin resolution of the remote video is beyond the range where the super resolution can be applied.\n                SuperResolutionUserCountOverLimitation: 1611. Super resolution is already being used on another remote user's video.\n                SuperResolutionDeviceNotSupported: 1612. The device does not support using super resolution.\n            \n            \n                \n                    This method is for Android and iOS only.\n                    Before calling this method, ensure that you have integrated the following dynamic libraries:\n                        Android: libagora_super_resolution_extension.so\n                        iOS: AgoraSuperResolutionExtension.xcframework\n                    \n                    \n                    Because this method has certain system performance requirements, Agora recommends that you use the following devices or better:\n                        Android:\n                            VIVO: V1821A, NEX S, 1914A, 1916A, 1962A, 1824BA, X60, X60 Pro\n                            OPPO: PCCM00, Find X3\n                            OnePlus: A6000\n                            Xiaomi: Mi 8, Mi 9, Mi 10, Mi 11, MIX3, Redmi K20 Pro\n                            SAMSUNG: SM-G9600, SM-G9650, SM-N9600, SM-G9708, SM-G960U, SM-G9750, S20, S21\n                            HUAWEI: SEA-AL00, ELE-AL00, VOG-AL00, YAL-AL10, HMA-AL00, EVR-AN00, nova 4, nova 5 Pro, nova 6 5G, nova 7 5G, Mate 30, Mate 30 Pro, Mate 40, Mate 40 Pro, P40, P40 Pro, Huawei M6, MatePad 10.8\n                        \n                        iOS:\n                            iPhone XR\n                            iPhone XS\n                            iPhone XS Max\n                            iPhone 11\n                            iPhone 11 Pro\n                            iPhone 11 Pro Max\n                            iPhone 12\n                            iPhone 12 mini\n                            iPhone 12 Pro\n                            iPhone 12 Pro Max\n                            iPhone 12 SE (2nd generation)\n                            iPad Pro 11-inch (3rd generation)\n                            iPad Pro 12.9-inch (3rd generation)\n                            iPad Air 3 (3rd generation)\n                            iPad Air 3 (4th generation)",
    "parameters": [
        {
            "userId": "The ID of the remote user."
        },
        {
            "enable": "Whether to enable super resolution for the remote user’s video:\n                        true: Enable virtual background.\n                        false: Do not enable virtual background.\n                    "
        }
    ],
    "returns": ""
}
