{
    "id": "class_transcodinguser",
    "name": "TranscodingUser",
    "description": "Transcoding configurations of each host.\n",
    "parameters": [
        {
            "uid": "\n  The user ID of the host.\n       "
        },
        {
            "x": "\n  The x coordinate (pixel) of the host's video on the output video frame (taking the upper left corner of the video frame as the origin). The value range is [0, width], where width is the LiveTranscodingwidth set in ."
        },
        {
            "y": "The y coordinate (pixel) of the host's video on the output video frame (taking the upper left corner of the video frame as the origin). The value range is [0, height], where height is the LiveTranscodingheight set in ."
        },
        {
            "width": "The width (pixel) of the host's video."
        },
        {
            "height": "\n                        The height (pixel) of the host's video.\n                    "
        },
        {
            "zOrder": "\n                        The layer index number of the host's video. The value range is [0, 100].\n                                0: (Default) The host's video is the bottom layer.\n                                100: The host's video is the top layer.\n                            \n                        \n                        \n                            \n                                If the value is beyond this range, the SDK reports the error code ERR_INVALID_ARGUMENT.\n                                As of v2.3, the SDK supports setting zOrder to 0.\n                            \n                        \n                    "
        },
        {
            "alpha": "\n                        The transparency of the host's video. The value range is [0.0, 1.0].\n                                0.0: Completely transparent.\n                                1.0: (Default) Opaque.\n                            \n                        \n                    "
        },
        {
            "audioChannel": "\n                        The audio channel used by the host's audio in the output audio. The default value is 0, and the value range is [0, 5].\n                                0: (Recommended) The defaut setting, which supports dual channels at most and depends on the upstream of the host.\n                                1: The host's audio uses the FL audio channel. If the host's upstream uses multiple audio channels, the Agora\n                                    server mixes them into mono first.\n                                2: The host's audio uses the FC audio channel. If the host's upstream uses multiple audio channels, the Agora\n                                    server mixes them into mono first.\n                                3: The host's audio uses the FR audio channel. If the host's upstream uses multiple audio channels, the Agora\n                                    server mixes them into mono first.\n                                4: The host's audio uses the BL audio channel. If the host's upstream uses multiple audio channels, the Agora\n                                    server mixes them into mono first.\n                                5: The host's audio uses the BR audio channel. If the host's upstream uses multiple audio channels, the Agora\n                                    server mixes them into mono first.\n                                0xFF or a value greater than 5: The host's audio is muted, and the Agora\n                                    server removes the host's audio.\n                            \n                            If the value is not 0, a special player is required.\n                    "
        }
    ],
    "returns": ""
}
