{
    "id": "class_injectstreamconfig",
    "name": "LiveInjectStreamConfig",
    "description": "Configurations of injecting an external audio or video stream.\nAgora will soon stop the service for injecting online media streams on the client. If you have not implemented this service, Agora recommends that you do not use it. For details, see Service Sunset Plans.",
    "parameters": [
        {
            "width": "The width of the external video stream after injecting. The default value is 0, which represents the same width as the original."
        },
        {
            "height": "The height of the external video stream after injecting. The default value is 0, which represents the same height as the original."
        },
        {
            "videoGop": "The GOP (in frames) of injecting the external video stream. The default value is 30 frames."
        },
        {
            "videoFramerate": "The frame rate (fps) of injecting the external video stream. The default rate is 15 fps."
        },
        {
            "videoBitrate": "\n                        The bitrate (Kbps) of injecting the external video stream. The default value is 400 Kbps.\n                        The bitrate setting is closely linked to the video resolution. If the bitrate you set is beyond a reasonable range, the SDK sets it within a reasonable range.\n                    "
        },
        {
            "audioSampleRate": "The sampling rate (Hz) of injecting the external audio stream. The default value is 48000 Hz. See AudioSampleRateType.\n                        Agora recommends using the default value.\n                    "
        },
        {
            "audioBitrate": "\n                        The bitrate (Kbps) of injecting the external audio stream. The default value is 48 Kbps.\n                        Agora recommends using the default value.\n                    "
        },
        {
            "audioChannels": "\n                        The number of channels of the external audio stream after injecting.\n                                1:  (Default) Mono.\n                                2: Stereo.\n                            \n                        \n                        Agora recommends using the default value.\n                    "
        }
    ],
    "returns": ""
}
