{
    "id": "class_remotevideostats",
    "name": "RemoteVideoStats",
    "description": "Statistics of the remote video stream.\n",
    "parameters": [
        {
            "uid": "The user ID of the remote user sending the video stream."
        },
        {
            "delay": "\n      \n \n     Deprecated:\n     In scenarios where audio and video are synchronized, you can get the video  delay data from networkTransportDelay and jitterBufferDelay in RemoteAudioStats.\n \n      \n      The video delay (ms).\n  "
        },
        {
            "width": "The width (pixels) of the video."
        },
        {
            "height": "The height (pixels) of the video."
        },
        {
            "receivedBitrate": "The bitrate (Kbps) of receiving the remote video since the last count."
        },
        {
            "decoderOutputFrameRate": "The frame rate (fps) of decoding the remote video."
        },
        {
            "rendererOutputFrameRate": "The frame rate (fps) of rendering the remote video."
        },
        {
            "packetLossRate": "The packet loss rate (%) of the remote video after using the anti-packet-loss technology."
        },
        {
            "rxStreamType": "The type of the video stream. "
        },
        {
            "totalFrozenTime": "The total freeze time (ms) of the remote video stream after the remote user joins the channel. In a video session where the frame rate is set to 5 fps or higher, video freeze occurs when the time interval between two adjacent video frames is more than 500\n      ms."
        },
        {
            "frozenRate": "The total video freeze time as a percentage (%) of the total time when the video is available. The video is available means that the remote user neither stops sending the video stream nor disables the video module after joining the channel."
        },
        {
            "totalActiveTime": "\n                        Total active time (ms) of the video.\n                        When the remote user/host neither stops sending the video stream nor disables the video module after joining the channel, the video is available."
        },
        {
            "publishDuration": "\n                        The total duration (ms) of the remote video stream."
        }
    ],
    "returns": ""
}
