{
    "id": "class_rtcsurfaceview",
    "name": "RtcSurfaceView",
    "description": "The RtcSurfaceView class, which is used for rendering the local and remote video.\nThis class corresponds to different classes on different platforms:\n                \n                    Android: SurfaceView (https://developer.android.com/reference/android/view/SurfaceView).\n                    iOS: UIView (https://developer.apple.com/documentation/uikit/uiview).\n                    Web: DivElement (https://api.dart.dev/stable/2.15.0/dart-html/DivElement-class.html).\n                    Does not apply to macOS or Windows.",
    "parameters": [
        {
            "uid": "The user ID."
        },
        {
            "channelId": "The channel name. This parameter signifies the channel in which users engage in real-time audio and video interaction. Under the premise of the same App ID, users who fill in the same channel ID enter the same channel for audio and video interaction. The string length must be less than 64 bytes. Supported characters:\n     The 26 lowercase English letters: a to z.\n     The 26 uppercase English letters: A to Z.\n     The 10 numeric characters: 0 to 9.\n     Space\n     \"!\", \"#\", \"$\", \"%\", \"&\", \"(\", \")\", \"+\", \"-\", \":\", \";\", \"<\", \"=\", \".\", \">\", \"?\", \"@\", \"[\", \"]\", \"^\", \"_\", \"{\", \"}\", \"|\", \"~\", \",\"\n \n  "
        },
        {
            "renderMode": "The video render mode. For details, see VideoRenderMode."
        },
        {
            "mirrorMode": "The video mirror mode. For details, see VideoMirrorMode."
        },
        {
            "zOrderOnTop": "Whether to place the surface on top of another surface view in the window, but still behind the window itsellf.\n                        This parameter is for Android only."
        },
        {
            "onPlatformViewCreated": "Occurs when a platform view is created."
        },
        {
            "gestureRecognizers": "The gesture object that should be consumed by the Web view. It is possible for other gesture recognizers to be competing\n                        with the web view on pointer events, e.g if the web view is inside a [ListView] the [ListView] will want to handle vertical\n                        drags. The web view will claim gestures that are recognized by any of the recognizers on this list.\n                        When this set is empty or null, the web view will only handle pointer events for gestures that were not claimed by any \n                            other gesture recognizer."
        },
        {
            "subProcess": "Whether to create a sub process."
        }
    ],
    "returns": ""
}
