{
    "id": "class_livetranscoding",
    "name": "LiveTranscoding",
    "description": "Transcoding configurations for CDN live streaming.\n",
    "parameters": [
        {
            "videoBitrate": "The video bitrate (Kbps) of the output media stream. The default value is 400. "
        },
        {
            "videoFrameRate": "The video frame rate (fps) of the output media stream. The default value is 15, and the value range is [1, 30].The Agora server adjusts\n                            any frame rate higher than 30 fps to 30 fps."
        },
        {
            "lowLatency": "\n                        \n                            \n                                Deprecated\n                                This attribute is deprecated since v2.8.0, and Agora does not recommend it.\n                            \n                        \n                        \n                            true: Low latency with unassured quality.\n                            false: (Default) High latency with assured quality.\n                        \n                    "
        },
        {
            "videoGop": "The video GOP (Group of Pictures) of the output media stream. The default value is 30."
        },
        {
            "videoCodecProfile": "\n                        The video encoding configuration of the output media stream. See VideoCodecProfileType.\n                        If you set this parameter to any other value, Agora adjusts it to the default value.\n                    "
        },
        {
            "transcodingUsers": "\n                        Transcoding configurations of each host. One live streaming channel supports up to 17 hosts. For details, see TranscodingUser.\n                    "
        },
        {
            "transcodingExtraInfo": "The user SEI information embedded in the output media stream. This parameter is used to send SEI information to the CDN. The maximum length is 4096 bytes. See How to solve SEI-related issues."
        },
        {
            "backgroundColor": "The video background color of the output media stream. The format is a hexadecimal integer defined by RGB without the # symbol. For example, 0xFFB6C1\n                        means light pink. The default value is 0x000000 (black)."
        },
        {
            "watermark": "The video watermark of the output media stream. Ensure that the format of the watermark image is PNG. For details, see AgoraImage."
        },
        {
            "backgroundImage": " The video background image of the output media stream. For details, see AgoraImage."
        },
        {
            "audioSampleRate": "The audio sampling rate (Hz) of the output media stream. See AudioSampleRateType."
        },
        {
            "audioBitrate": "The audio bitrate (Kbps) of the output media stream. The default value is 48, and the maximum is 128."
        },
        {
            "audioChannels": "The number of audio channels of the output media stream. The default value is 1. Agora recommends setting it to 1 or 2.\n                            1: (Default) Mono\n                            2: Stereo.\n                            3: Three audio channels.\n                            4: Four audio channels.\n                            5: Five audio channels.\n                        \n                    "
        },
        {
            "audioCodecProfile": "The audio codec of the output media stream. For details, see AudioCodecProfileType."
        }
    ],
    "returns": ""
}
