{
    "id": "enum_connectionchangedreasontype",
    "name": "ConnectionChangedReason",
    "description": "Reasons causing the change of the connection state.\n",
    "parameters": [
        {
            "Connecting": "0: The SDK is connecting to the Agora edge server."
        },
        {
            "JoinSuccess": "1: The SDK has joined the channel successfully."
        },
        {
            "Interrupted": "2: The connection between the SDK and the Agora edge server is interrupted."
        },
        {
            "BannedByServer": "3: The connection between the SDK and the Agora edge server is banned by the Agora edge server. This error occurs when the user is kicked out of the channel by the server."
        },
        {
            "JoinFailed": "4: The SDK fails to join the channel. When the SDK fails to join the channel for more than 20 minutes, this error occurs and the SDK stops reconnecting to the channel."
        },
        {
            "LeaveChannel": "5: The SDK has left the channel."
        },
        {
            "InvalidAppId": "6: The connection failed because the App ID is not valid. Please rejoin the channel with a valid App ID."
        },
        {
            "InvalidChannelName": "7: The connection failed since channel name is not valid. Please rejoin the channel with a valid channel name."
        },
        {
            "InvalidToken": "8: The connection failed because the token is not valid. Typical reasons include:\n      The App Certificate for the project is enabled in Agora Console, but you do not use a token when joining the channel. If you enable the App Certificate, you must use a token to join the channel.\n      The uid specified when calling joinChannel to join the channel is inconsistent with the uid passed in when generating the token.\n  "
        },
        {
            "TokenExpired": "9: The connection failed since token is expired."
        },
        {
            "RejectedByServer": "10: The connection is rejected by server. Typical reasons include:\n      The user is already in the channel and still calls a method, for example, joinChannel, to join the channel. Stop calling this method to clear this error.\n      The user tries to join the channel when conducting  a pre-call test. The user needs to call the channel after the call test ends.\n  \n  "
        },
        {
            "SettingProxyServer": "11: The connection state changed to reconnecting because the SDK has set a proxy server."
        },
        {
            "RenewToken": "12: The connection state changed because the token is renewed."
        },
        {
            "ClientIpAddressChanged": "13: The IP address of the client has changed, possibly because the network type, IP address, or port has been changed."
        },
        {
            "KeepAliveTimeout": "14: Timeout for the keep-alive of the connection between the SDK and the Agora edge server. The connection state changes to Reconnecting."
        }
    ],
    "returns": ""
}
